{
  "sections": [
    {
      "title": "General requirements for indefinite leave to remain",
      "paragraphs": [
        {
          "number": "245AAA",
          "text": "The following rules apply to all requirements for indefinite leave to remain in Part 6A and Appendix A:"
        },
        {
          "number": "za",
          "text": "References to “PhD level occupation” refer to the following SOC 2010 occupation codes, Chemical scientists, Biological scientists and biochemists, Physical scientists, Social and humanities scientists, Natural and social science professionals not elsewhere classified, Research and development managers, Higher education teaching professionals"
        },
        {
          "number": "a",
          "text": "References to a “continuous period” “lawfully in the UK” means, subject to paragraph (e), residence in the UK for an unbroken period with valid leave, and for these purposes a period shall be considered unbroken where: the applicant has not been absent from the UK for more than 180 days during any 12 month period in the continuous period, except that the applicant has existing limited leave to enter or remain upon their departure and return, except that the applicant has any current period of overstaying disregarded where paragraph 39E of these Rules applies, the applicant has any previous period of overstaying between periods of leave disregarded where: the further application was made before 24 November 2016 and within 28 days of the expiry of leave; or the further application was made on or after 24 November 2016 and paragraph 39E of these Rules applied."
        },
        {
          "number": "c",
          "text": "Except for periods where the applicant had leave as a Tier 1(Investor) Migrant, a Tier 1(Entrepreneur) Migrant, a Tier 1(Exceptional Talent) Migrant or a highly skilled migrant, any absences from the UK during the relevant qualifying period must have been for a purpose that is consistent with the applicant’s basis of stay here, including paid annual leave, or for serious or compelling reasons."
        },
        {
          "number": "d",
          "text": "The continuous period will be considered as ending on whichever of the following dates is most beneficial to the applicant: the date of application; the date of decision; or any date up to 28 days after the date of application."
        },
        {
          "number": "e",
          "text": "References to a continuous period spent with valid leave in the UK include time spent with valid leave in the Bailiwick of Guernsey, the Bailiwick of Jersey or the Isle of Man, where that leave was granted for an equivalent purpose to one of the categories stated in the relevant paragraph, provided that the most recent period prior to the date of application was spent in the UK with valid leave in the relevant category."
        }
      ]
    },
    {
      "title": "Documents not submitted with applications",
      "paragraphs": [
        {
          "number": "245AA",
          "text": "Subject to sub-paragraph (b) and where otherwise indicated, where Part 6A or any appendices referred to in Part 6A state that specified documents must be provided, the decision maker (that is the Entry Clearance Officer, Immigration Officer or the Secretary of State) will only consider documents received by the Home Office before the date on which the application is considered."
        },
        {
          "number": "b",
          "text": "If the applicant has submitted the specified documents and: specified evidence is missing from the documents; a document is in the wrong format (for example, if a letter is not on letterhead paper as specified); a document does not contain all of the specified information; the decision maker may contact the applicant or his representative in writing, and request the correct documents. The requested documents must be received at the address specified in the request within 10 working days of the date of the request."
        },
        {
          "number": "c",
          "text": "Documents will not be requested where the decision maker does not think that the submission of missing or correct documents will lead to a grant because the application will be refused for other reasons."
        },
        {
          "number": "d",
          "text": "If the applicant has omitted to provide specified evidence, or submitted it in the wrong format, but the missing information is verifiable from other documents provided with the application or elsewhere, the decision maker may grant the application despite the error or omission, if they are satisfied that the applicant meets all the other requirements of the Rules."
        }
      ]
    },
    {
      "title": "Tier 1 (Entrepreneur) Migrants",
      "paragraphs": [
        {
          "number": "245D",
          "text": "Purpose of this route and meaning of business, (i) This category is now closed to new applicants. For the purpose of paragraphs 245D to 245DF and paragraphs 35 to 53 of Appendix A ‘business’ means an enterprise as: a sole trader, a partnership, or a company registered in the UK. Where paragraphs 245D to 245DF and paragraphs 35 to 53 of Appendix A, refer to money remaining available to the applicant until such time as it is spent for the purposes of his business or businesses: 'Available’ means that the funds are: in the applicant’s own possession, in the financial accounts of the UK business(es) which they are relying on to claim points, or available from the third party or parties named in the application under the terms of the declaration(s) referred to in paragraph 41(a)(vi) of Appendix A. ‘Invested’ means that the funds have been invested into a business or businesses which the applicant is running as self-employed or as a director or member of a partnership. ‘Invested’ or ‘spent’ excludes spending on: the applicant’s own remuneration, buying any business from a previous owner, where the money ultimately goes to that previous owner, investing in businesses, other than those which the applicant is running as self-employed or as a director, and any spending which is not directly for the purpose of establishing or running the applicant’s own business or businesses."
        },
        {
          "number": "245DA",
          "text": "Entry to the UK: All migrants arriving in the UK and wishing to enter as a Tier 1 (Entrepreneur) Migrant must have a valid entry clearance for entry under this route. If they do not have a valid entry clearance, entry will be refused."
        },
        {
          "number": "245DB",
          "text": "Requirements for entry clearance: The applicant must not fall for refusal under the general grounds for refusal. The applicant must have a minimum of 75 points under paragraphs 35 to 53 of Appendix A. The applicant must have a minimum of 10 points under paragraph 1 to 15 of Appendix B. The applicant must have a minimum of 10 points under paragraph 1 to 2 of Appendix C. The applicant must have entry clearance, leave to enter or leave to remain as: a Tier 1 (Entrepreneur) Migrant, a Tier 1 (Graduate Entrepreneur) Migrant, or a Start-up migrant, having previously held leave as a Tier 1 (Graduate Entrepreneur) Migrant, or have had such leave in the 12 months immediately before the date of application. The applicant must provide a business plan, setting out his proposed business activities in the UK and how he expects to make his business succeed."
        }
      ]
    },
    {
      "title": "Tier 1 (Investor) Migrants",
      "paragraphs": [
        {
          "number": "245E",
          "text": "Purpose: This route is for high net worth individuals making a substantial financial investment to the UK. This route is now closed to new applicants. Individuals who already have entry clearance, leave to enter or remain as a Tier 1 (Investor) Migrant may apply under these rules to extend their stay or for indefinite leave to remain."
        },
        {
          "number": "245EA",
          "text": "Entry to the UK: All migrants arriving in the UK and wishing to enter as a Tier 1 (Investor) Migrant must have a valid entry clearance for entry under this route. If they do not have a valid entry clearance, entry will be refused."
        }
      ]
    }
  ]
}
