{
  "sections": [
    {
      "title": "Validity requirements for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 1.1",
          "text": "A person applying for entry clearance as a Short-term Student must apply online on the gov.uk website on the specified form 'Short-term Student visa'."
        },
        {
          "number": "STS 1.2",
          "text": "An application for entry clearance as a Short-term Student must meet all the following requirements: (a) any fee and Immigration Health Charge must have been paid; and (b) the applicant must have provided any required biometrics; and (c) the applicant must have provided a passport or other travel document which satisfactorily establishes their identity and nationality; and (d) the applicant must be outside the UK."
        },
        {
          "number": "STS 1.3",
          "text": "The applicant must be aged 16 or over on the date of application."
        },
        {
          "number": "STS 1.4",
          "text": "An application which does not meet all the validity requirements for a Short-term Student may be rejected as invalid and not considered."
        }
      ]
    },
    {
      "title": "Suitability requirements for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 2.1",
          "text": "The applicant must not fall for refusal under Part 9: grounds for refusal."
        }
      ]
    },
    {
      "title": "Entry requirements for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 3.1",
          "text": "A person seeking to come to the UK as a Short-term Student must obtain entry clearance as a Short-term Student before they arrive in the UK."
        },
        {
          "number": "STS 3.2",
          "text": "A person applying for entry clearance as a Short-term Student for more than 6 months must, if Appendix Tuberculosis applies, provide a valid medical certificate confirming that they have undergone screening for active pulmonary tuberculosis and that this tuberculosis is not present in them."
        }
      ]
    },
    {
      "title": "Course requirements for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 4.1",
          "text": "The course provider must be an accredited institution."
        },
        {
          "number": "STS 4.2",
          "text": "The applicant must provide written evidence from the course provider that the applicant has been accepted onto an English language course (that does not include any other subject) that lasts at least 6 months and no longer than 11 months."
        }
      ]
    },
    {
      "title": "Study requirement for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 5.1",
          "text": "The applicant must not intend to do any of the following during their time in the UK as a Short-term Student: (a) undertake a course of study of longer than 11 months; or (b) study at an academy or state-funded school; or (c) make the UK their main home; or (d) work in the UK; or (e) engage in any business or professional activities in the UK."
        },
        {
          "number": "STS 5.2",
          "text": "The applicant must intend to leave the UK within 30 days of the end of their English language course, or at the end of 11 months, whichever is sooner."
        }
      ]
    },
    {
      "title": "Financial requirements for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 6.1",
          "text": "The applicant must be able to maintain and accommodate themselves adequately without receiving public funds."
        },
        {
          "number": "STS 6.2",
          "text": "The applicant must have enough funds to meet the cost of their return or onward journey from the UK."
        },
        {
          "number": "STS 6.3",
          "text": "At the date of application, the applicant must have paid their course fees or have enough funds to pay their course fees."
        },
        {
          "number": "STS 6.4",
          "text": "Funds must be shown as specified in Appendix Finance."
        }
      ]
    },
    {
      "title": "Parental consent requirement for a Short-term Student aged 16 or 17",
      "paragraphs": [
        {
          "number": "STS 7.1",
          "text": "The applicant must meet the parental consent requirement for applicant not applying as a dependent child in Appendix Children."
        }
      ]
    },
    {
      "title": "Decision on application as a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 8.1",
          "text": "If the decision maker is satisfied that all the suitability and eligibility requirements for a Short-term Student are met the application will be granted, otherwise the application will be refused."
        },
        {
          "number": "STS 8.2",
          "text": "If the application is refused, the person can apply for an Administrative Review under Appendix AR: Administrative Review."
        }
      ]
    },
    {
      "title": "Period and conditions of grant for a Short-term Student",
      "paragraphs": [
        {
          "number": "STS 9.1",
          "text": "The applicant will be granted permission for 11 months."
        },
        {
          "number": "STS 9.2",
          "text": "The grant will be subject to all the following conditions: (a) no access to public funds; (b) no work; and (c) study only on the course for which the applicant was granted permission."
        }
      ]
    }
  ]
}
